# Dataset 2

moving to another notebook bc I'm getting impatient

In [2]:
import pandas as pd
import numpy as np
import regex as re

In [3]:
# Reading 2nd dataset file
dataset2 = pd.read_csv('data/combined_data_2.txt',header = None, names = ['cust_id', 'rating', 'date'])
dataset2.head()

   cust_id  rating        date
0    4500:     NaN         NaN
1  2532865     4.0  2005-07-26
2   573364     3.0  2005-06-20
3  1696725     3.0  2004-02-27
4  1253431     3.0  2004-03-31

In [4]:
dataset2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26982302 entries, 0 to 26982301
Data columns (total 3 columns):
 #   Column   Dtype
---  ------   -----
 0   cust_id  object
 1   rating   float64
 2   date     object
dtypes: float64(1), object(2)
memory usage: 617.6+ MB

In [5]:
# only movie id vals

mid_index2 = pd.DataFrame(dataset2[(dataset2['rating'].isnull())])
mid_index2.head()

     cust_id  rating date
0      4500:     NaN  NaN
259    4501:     NaN  NaN
855    4502:     NaN  NaN
960    4503:     NaN  NaN
2740   4504:     NaN  NaN

In [6]:
#rename movie index
mid_index2 = mid_index2.rename(columns = {'cust_id': 'movie_id'})
mid_index2.head()

     movie_id  rating date
0       4500:     NaN  NaN
259     4501:     NaN  NaN
855     4502:     NaN  NaN
960     4503:     NaN  NaN
2740    4504:     NaN  NaN

In [16]:
#drop movieid punctuation
def drop_punctuation(df):
    midnew = []
    for index, row in df.iterrows():
        mid1 = str(row['movie_id'])
        regex = r"[^\w\s]"
        mid1 = re.sub(regex, '', mid1)
        midnew.append(mid1)
        
    df['mid'] = midnew

    return df

In [13]:
#test = mid_index2['movie_id'][0]
#test

'4500:'

In [15]:
#test
#regex = r"[^\w\s]"
#test = re.sub(regex, '', test)
#test

'4500'

In [21]:
#drop punctuation, drop other cols
drop_punctuation(mid_index2)
mid_index2 = mid_index2[['mid']]
mid_index2.head()

       mid
0     4500
259   4501
855   4502
960   4503
2740  4504

In [23]:
mid_index2.shape

(4711, 1)

In [24]:
dataset2.head()

   cust_id  rating        date
0    4500:     NaN         NaN
1  2532865     4.0  2005-07-26
2   573364     3.0  2005-06-20
3  1696725     3.0  2004-02-27
4  1253431     3.0  2004-03-31

In [26]:
#concatenate the full dataset with midindex rows
d2 = pd.concat([dataset2, mid_index2], axis = 1)
d2.head()

   cust_id  rating        date   mid
0    4500:     NaN         NaN  4500
1  2532865     4.0  2005-07-26   NaN
2   573364     3.0  2005-06-20   NaN
3  1696725     3.0  2004-02-27   NaN
4  1253431     3.0  2004-03-31   NaN

In [27]:
#checking for mid 4504
d2.iloc[2740]

cust_id    4504:
rating       NaN
date         NaN
mid         4504
Name: 2740, dtype: object

In [28]:
d2 = d2.reindex(['mid', 'cust_id', 'rating', 'date'], axis= 1)
d2.head()

    mid  cust_id  rating        date
0  4500    4500:     NaN         NaN
1   NaN  2532865     4.0  2005-07-26
2   NaN   573364     3.0  2005-06-20
3   NaN  1696725     3.0  2004-02-27
4   NaN  1253431     3.0  2004-03-31

In [29]:
def fill_mids(df, column_name):
    """
    iterates through df col
    replaces nan vals with movie id until it reaches a new movie id
    """
    # Find the first non-NaN value in the column
    first_value = df[column_name].dropna().iloc[0]
    
    # Iterate through the column, filling NaNs with the previous non-NaN value
    for i in range(len(df)):
        if pd.isna(df.loc[i, column_name]):
            df.loc[i, column_name] = first_value
        else:
            first_value = df.loc[i, column_name]
            if pd.isna(first_value):
                first_value = df[column_name].dropna().iloc[0]

In [32]:
fill_mids(d2, 'mid')
d2.head()

    mid  cust_id  rating        date
0  4500    4500:     NaN         NaN
1  4500  2532865     4.0  2005-07-26
2  4500   573364     3.0  2005-06-20
3  4500  1696725     3.0  2004-02-27
4  4500  1253431     3.0  2004-03-31

In [34]:
d2.iloc[960]

mid         4503
cust_id    4503:
rating       NaN
date         NaN
Name: 960, dtype: object

In [36]:
#removing cust id with movie ids in them

d2['cust_id'].str.contains(':').sum()

4711

In [38]:
d2 = d2[~d2['cust_id'].str.contains(':')]
d2.shape

(26977591, 4)

In [39]:
d2['date'] = d2['date'].astype('datetime64[ns]')
d2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 26977591 entries, 1 to 26982301
Data columns (total 4 columns):
 #   Column   Dtype
---  ------   -----
 0   mid      object
 1   cust_id  object
 2   rating   float64
 3   date     datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(2)
memory usage: 1.0+ GB

/var/folders/xc/4fn08svj2dgdk_3wj3xkp_rr0000gn/T/ipykernel_29698/3053115047.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d2['date'] = d2['date'].astype('datetime64[ns]')

In [40]:
d2['year'] = d2['date'].dt.year
d2.head()

/var/folders/xc/4fn08svj2dgdk_3wj3xkp_rr0000gn/T/ipykernel_29698/2478966670.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d2['year'] = d2['date'].dt.year

    mid  cust_id  rating       date  year
1  4500  2532865     4.0 2005-07-26  2005
2  4500   573364     3.0 2005-06-20  2005
3  4500  1696725     3.0 2004-02-27  2004
4  4500  1253431     3.0 2004-03-31  2004
5  4500  1265574     2.0 2003-09-01  2003

In [41]:
d2['month'] = d2['date'].dt.month
d2.head()

/var/folders/xc/4fn08svj2dgdk_3wj3xkp_rr0000gn/T/ipykernel_29698/2999920986.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d2['month'] = d2['date'].dt.month

    mid  cust_id  rating       date  year  month
1  4500  2532865     4.0 2005-07-26  2005      7
2  4500   573364     3.0 2005-06-20  2005      6
3  4500  1696725     3.0 2004-02-27  2004      2
4  4500  1253431     3.0 2004-03-31  2004      3
5  4500  1265574     2.0 2003-09-01  2003      9

In [42]:
d2['day'] = d2['date'].dt.day
d2.head()

/var/folders/xc/4fn08svj2dgdk_3wj3xkp_rr0000gn/T/ipykernel_29698/340210831.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  d2['day'] = d2['date'].dt.day

    mid  cust_id  rating       date  year  month  day
1  4500  2532865     4.0 2005-07-26  2005      7   26
2  4500   573364     3.0 2005-06-20  2005      6   20
3  4500  1696725     3.0 2004-02-27  2004      2   27
4  4500  1253431     3.0 2004-03-31  2004      3   31
5  4500  1265574     2.0 2003-09-01  2003      9    1

In [43]:
#quarterly bins

def quarter(row):
    if row['month'] < 4:
        return 1
    elif 4 <= row['month'] < 7:
        return 2
    elif 7 <= row['month'] < 9:
        return 3
    else:
        return 4

In [44]:
d2['fisc_Q'] = d2.apply(quarter, axis=1)
d2.head()

    mid  cust_id  rating       date  year  month  day  fisc_Q
1  4500  2532865     4.0 2005-07-26  2005      7   26       3
2  4500   573364     3.0 2005-06-20  2005      6   20       2
3  4500  1696725     3.0 2004-02-27  2004      2   27       1
4  4500  1253431     3.0 2004-03-31  2004      3   31       1
5  4500  1265574     2.0 2003-09-01  2003      9    1       4

In [ ]:
d2.to_csv('data/d2_clean.csv')